//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************


//
// @file ServerMgmtSetupStrings.uni
//
//  String definitions for the Server Management setup screen.
//

#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"    // AMI Mapping Language

#string STR_EMPTY                           #language en-US ""

#string STR_ENABLED                         #language en-US "Enabled"
#string STR_DISABLED                        #language en-US "Disabled"
#string STR_NONE                            #language en-US "None"
#string STR_AUTO                            #language en-US "Auto"

#string STR_SERVER_MGMT_TITLE               #language en-US "Server Mgmt"
#string STR_SERVER_MGMT_TITLE_HELP          #language en-US "Press <Enter> to view or change the Server management configuration."

#string STR_ENABLING_DISABLING_OPTIONS      #language en-US "Enabling/Disabling Options"
#string STR_BMC_SUPPORT                     #language en-US "BMC Support"
                                            #language x-UEFI-AMI "IPMI600"
#string STR_BMC_SUPPORT_HELP                #language en-US "Enable/Disable interfaces to communicate with BMC"

#string STR_WAIT_FOR_BMC_RESPONSE           #language en-US "Wait For BMC"
                                            #language x-UEFI-AMI  "IPMI601"
#string STR_WAIT_FOR_BMC_RESPONSE_HELP      #language en-US "Wait For BMC response for specified time out. In PILOTII, BMC starts at the same time when BIOS starts during AC power ON. It takes around 30 seconds to initialize Host to BMC interfaces."
#string STR_IPMI_BMC_SELF_TEST_STATUS       #language en-US "BMC Self Test Status"
#string STR_IPMI_BMC_SELF_TEST_STATUS_VAL   #language en-US ""
                                            #language x-UEFI-AMI "IPMI603"

#string STR_BMC_TIME_ZONE                   #language en-US "Time Zone(UTC Offset)"
                                            #language x-UEFI-AMI "IPMI602"
#string STR_BMC_TIME_ZONE_HELP              #language en-US "Enter UTC Offset in hours i.e. from -24:00 to +24:00. These values will be converted into minutes and programmed to BMC. Enter 0x07FF to consider BIOS time as local time"
#string STR_BMC_CURR_TIME_ZONE              #language en-US "Current Time Zone"
#string STR_BMC_CURR_TIME_ZONE_VALUE        #language en-US "Unspecified"
                                            #language x-UEFI-AMI "IPMI604"

#string STR_BMC_TIME_ZONE_DEFAULT           #language en-US "0x07FF"

#string STR_IPMI_BMC_DEVICE_ID              #language en-US "BMC Device ID"
#string STR_IPMI_BMC_DEVICE_ID_VAL          #language en-US "Unknown"
                                            #language x-UEFI-AMI "IPMI605"

#string STR_IPMI_BMC_DEVICE_REVISION        #language en-US "BMC Device Revision"
#string STR_IPMI_BMC_DEVICE_REVISION_VAL    #language en-US "Unknown"
                                            #language x-UEFI-AMI "IPMI606"

#string STR_IPMI_BMC_FIRMWARE_REVISION      #language en-US "BMC Firmware Revision"
#string STR_IPMI_BMC_FIRMWARE_REVISION_VAL  #language en-US "Unknown"
                                            #language x-UEFI-AMI "IPMI607"

#string STR_IPMI_VERSION                    #language en-US "IPMI Version"
#string STR_IPMI_VERSION_VAL                #language en-US "Unknown"
                                            #language x-UEFI-AMI "IPMI608"

#string STR_IPMI_BMC_WARM_RESET_HELP        #language en-US "Press <Enter> to do Warm Reset BMC."
#string STR_IPMI_BMC_WARM_RESET             #language en-US "BMC Warm Reset"


#string STR_BMC_WARM_RESET_INFO             #language en-US "BMC WARM RESET INFO"
#string STR_WARM_RESET_BMC                  #language en-US " Warm Reset BMC? "
#string STR_PROTOCOL_NOT_FOUND              #language en-US " Protocol Not Found!!! "
#string STR_BMC_WARM_RESET_ERROR_INFO       #language en-US "BMC WARM RESET ERROR INFO"
#string STR_BMC_WARM_RESET_FAIL             #language en-US " BMC Warm Reset Fails!!! "
#string STR_BMC_WARM_RESET_DONE             #language en-US " BMC Warm Reset Done Successfully!!! "
#string STR_TIME_ZONE_ERROR_INFO            #language en-US "TIME ZONE ERROR INFO"
#string STR_INVALID_TIME_ZONE               #language en-US "Invalid Time zone Entered!!!"

